headHUB/arduino-linuxgpio/patches/boards.txt
##############################################################

avrpi328_8.name=AVRPi-328 ATmega328p @ 8MHz

avrpi328_8.upload.using=linuxgpio
avrpi328_8.upload.protocol=linuxgpio
avrpi328_8.upload.maximum_size=32768
avrpi328_8.upload.speed=57600
avrpi328_8.upload.disable_flushing=true

avrpi328_8.bootloader.low_fuses=0xE7
avrpi328_8.bootloader.high_fuses=0xDA
avrpi328_8.bootloader.extended_fuses=0x07
avrpi328_8.bootloader.path=atmega
avrpi328_8.bootloader.file=ATmegaBOOT_168_atmega328.hex
avrpi328_8.bootloader.unlock_bits=0x3F
avrpi328_8.bootloader.lock_bits=0x0F

avrpi328_8.build.mcu=atmega328p
avrpi328_8.build.f_cpu=8000000L
avrpi328_8.build.core=arduino
avrpi328_8.build.variant=standard

##############################################################

avrpi328_12.name=AVRPi-328 ATmega328p @ 12MHz

avrpi328_12.upload.using=linuxgpio
avrpi328_12.upload.protocol=linuxgpio
avrpi328_12.upload.maximum_size=32768
avrpi328_12.upload.speed=57600
avrpi328_12.upload.disable_flushing=true

avrpi328_12.bootloader.low_fuses=0xE7
avrpi328_12.bootloader.high_fuses=0xDA
avrpi328_12.bootloader.extended_fuses=0x07
avrpi328_12.bootloader.path=atmega
avrpi328_12.bootloader.file=ATmegaBOOT_168_atmega328.hex
avrpi328_12.bootloader.unlock_bits=0x3F
avrpi328_12.bootloader.lock_bits=0x0F

avrpi328_12.build.mcu=atmega328p
avrpi328_12.build.f_cpu=12000000L
avrpi328_12.build.core=arduino
avrpi328_12.build.variant=standard

##############################################################

avrpi328_16.name=AVRPi-328 ATmega328p @ 16MHz

avrpi328_16.upload.using=linuxgpio
avrpi328_16.upload.protocol=linuxgpio
avrpi328_16.upload.maximum_size=32768
avrpi328_16.upload.speed=57600
avrpi328_16.upload.disable_flushing=true

avrpi328_16.bootloader.low_fuses=0xE7
avrpi328_16.bootloader.high_fuses=0xDA
avrpi328_16.bootloader.extended_fuses=0x07
avrpi328_16.bootloader.path=atmega
avrpi328_16.bootloader.file=ATmegaBOOT_168_atmega328.hex
avrpi328_16.bootloader.unlock_bits=0x3F
avrpi328_16.bootloader.lock_bits=0x0F

avrpi328_16.build.mcu=atmega328p
avrpi328_16.build.f_cpu=16000000L
avrpi328_16.build.core=arduino
avrpi328_16.build.variant=standard

##############################################################

avrpi32u4_8.name=AVRPi-32U4 ATmega32U4 @ 8MHz

avrpi32u4_8.upload.using=linuxgpio
avrpi32u4_8.upload.protocol=linuxgpio
avrpi32u4_8.upload.maximum_size=32768
avrpi32u4_8.upload.speed=57600
avrpi32u4_8.upload.disable_flushing=true

avrpi32u4_8.bootloader.low_fuses=0xff
avrpi32u4_8.bootloader.high_fuses=0xd8
avrpi32u4_8.bootloader.extended_fuses=0xcb
avrpi32u4_8.bootloader.path=caterina
avrpi32u4_8.bootloader.file=Caterina-Leonardo.hex
avrpi32u4_8.bootloader.unlock_bits=0x3F
avrpi32u4_8.bootloader.lock_bits=0x2F

avrpi32u4_8.build.mcu=atmega32u4
avrpi32u4_8.build.f_cpu=8000000L
avrpi32u4_8.build.vid=0x2341
avrpi32u4_8.build.pid=0x8036
avrpi32u4_8.build.core=arduino
avrpi32u4_8.build.variant=leonardo

##############################################################

avrpi32u4_8cat.name=AVRPi-32U4 ATmega32U4 @ 8MHz Caterina Bootloader

avrpi32u4_8cat.upload.using=linuxgpio
avrpi32u4_8cat.upload.protocol=avr109
avrpi32u4_8cat.upload.maximum_size=28672
avrpi32u4_8cat.upload.speed=57600
avrpi32u4_8cat.upload.disable_flushing=true

avrpi32u4_8cat.bootloader.low_fuses=0xff
avrpi32u4_8cat.bootloader.high_fuses=0xd8
avrpi32u4_8cat.bootloader.extended_fuses=0xcb
avrpi32u4_8cat.bootloader.path=caterina
avrpi32u4_8cat.bootloader.file=Caterina-Leonardo.hex
avrpi32u4_8cat.bootloader.unlock_bits=0x3F
avrpi32u4_8cat.bootloader.lock_bits=0x2F

avrpi32u4_8cat.build.mcu=atmega32u4
avrpi32u4_8cat.build.f_cpu=8000000L
avrpi32u4_8cat.build.vid=0x2341
avrpi32u4_8cat.build.pid=0x8036
avrpi32u4_8cat.build.core=arduino
avrpi32u4_8cat.build.variant=leonardo

##############################################################

gert328.name=Gertboard with ATmega328 @ 12MHz

gert328.upload.using=linuxgpio
gert328.upload.protocol=linuxgpio
gert328.upload.maximum_size=32768
gert328.upload.speed=57600
gert328.upload.disable_flushing=true

gert328.bootloader.low_fuses=0xE7
gert328.bootloader.high_fuses=0xDA
gert328.bootloader.extended_fuses=0x07
gert328.bootloader.path=atmega
gert328.bootloader.file=ATmegaBOOT_168_gert328.hex
gert328.bootloader.unlock_bits=0x3F
gert328.bootloader.lock_bits=0x0F

gert328.build.mcu=atmega328p
gert328.build.f_cpu=12000000L
gert328.build.core=arduino
gert328.build.variant=standard


##############################################################

gert168.name=Gertboard with ATmega168 @ 12MHz

gert168.upload.using=linuxgpio
gert168.upload.protocol=linuxgpio
gert168.upload.maximum_size=16384
gert168.upload.speed=57600
gert168.upload.disable_flushing=true

gert168.bootloader.low_fuses=0xE7
gert168.bootloader.high_fuses=0xDA
gert168.bootloader.extended_fuses=0x07
gert168.bootloader.path=atmega
gert168.bootloader.file=ATmegaBOOT_168_gert168.hex
gert168.bootloader.unlock_bits=0x3F
gert168.bootloader.lock_bits=0x0F

gert168.build.mcu=atmega168
gert168.build.f_cpu=12000000L
gert168.build.core=arduino
gert168.build.variant=standard

##############################################################

#gertduino48.name=Gertduino ATmega48 @ 8MHz

#gertduino48.upload.using=linuxgpio
#gertduino48.upload.protocol=linuxgpio
#gertduino48.upload.maximum_size=4096
#gertduino48.upload.speed=57600
#gertduino48.upload.disable_flushing=true

#gertduino48.bootloader.low_fuses=0xE2
#gertduino48.bootloader.high_fuses=0xDF
#gertduino48.bootloader.extended_fuses=0x01
#gertduino48.bootloader.path=atmega
#gertduino48.bootloader.file=ATmegaBOOT_48_gert48.hex
#gertduino48.bootloader.unlock_bits=0x3F
#gertduino48.bootloader.lock_bits=0x0F

#gertduino48.build.mcu=atmega48p
#gertduino48.build.f_cpu=8000000L
#gertduino48.build.core=arduino
#gertduino48.build.variant=standard


##############################################################

#gertduino328.name=Gertduino with ATmega328 @ 16MHz

#gertduino328.upload.using=linuxgpio
#gertduino328.upload.protocol=linuxgpio
#gertduino328.upload.maximum_size=32768
#gertduino328.upload.speed=57600
#gertduino328.upload.disable_flushing=true

