headHUB/arduino-linuxgpio/patches/boards.txt
#gertduino328.bootloader.low_fuses=0xE7
#gertduino328.bootloader.high_fuses=0xDA
#gertduino328.bootloader.extended_fuses=0x07
#gertduino328.bootloader.path=atmega
#gertduino328.bootloader.file=ATmegaBOOT_168_gert328.hex
#gertduino328.bootloader.unlock_bits=0x3F
#gertduino328.bootloader.lock_bits=0x0F

#gertduino328.build.mcu=atmega328p
#gertduino328.build.f_cpu=16000000L
#gertduino328.build.core=arduino
#gertduino328.build.variant=standard


##############################################################

#gertduino168.name=Gertduino with ATmega168 @ 16MHz

#gertduino168.upload.using=linuxgpio
#gertduino168.upload.protocol=linuxgpio
#gertduino168.upload.maximum_size=16384
#gertduino168.upload.speed=57600
#gertduino168.upload.disable_flushing=true

#gertduino168.bootloader.low_fuses=0xE7
#gertduino168.bootloader.high_fuses=0xDA
#gertduino168.bootloader.extended_fuses=0x07
#gertduino168.bootloader.path=atmega
#gertduino168.bootloader.file=ATmegaBOOT_168_gert168.hex
#gertduino168.bootloader.unlock_bits=0x3F
#gertduino168.bootloader.lock_bits=0x0F

#gertduino168.build.mcu=atmega168
#gertduino168.build.f_cpu=16000000L
#gertduino168.build.core=arduino
#gertduino168.build.variant=standard

##############################################################

raspioduino.name=RasPiO Duino with ATmega328 @ 12MHz

raspioduino.upload.using=linuxgpio
raspioduino.upload.protocol=linuxgpio
raspioduino.upload.maximum_size=32768
raspioduino.upload.speed=57600
raspioduino.upload.disable_flushing=true

raspioduino.bootloader.low_fuses=0xE7
raspioduino.bootloader.high_fuses=0xDA
raspioduino.bootloader.extended_fuses=0x07
raspioduino.bootloader.path=atmega
raspioduino.bootloader.file=ATmegaBOOT_168_gert328.hex
raspioduino.bootloader.unlock_bits=0x3F
raspioduino.bootloader.lock_bits=0x0F

raspioduino.build.mcu=atmega328p
raspioduino.build.f_cpu=12000000L
raspioduino.build.core=arduino
raspioduino.build.variant=standard

##############################################################

# See: http://code.google.com/p/arduino/wiki/Platforms

##############################################################

uno.name=Arduino Uno
uno.upload.protocol=arduino
uno.upload.maximum_size=32256
uno.upload.speed=115200
uno.bootloader.low_fuses=0xff
uno.bootloader.high_fuses=0xde
uno.bootloader.extended_fuses=0x05
uno.bootloader.path=optiboot
uno.bootloader.file=optiboot_atmega328.hex
uno.bootloader.unlock_bits=0x3F
uno.bootloader.lock_bits=0x0F
uno.build.mcu=atmega328p
uno.build.f_cpu=16000000L
uno.build.core=arduino
uno.build.variant=standard

##############################################################

atmega328.name=Arduino Duemilanove w/ ATmega328

atmega328.upload.protocol=arduino
atmega328.upload.maximum_size=30720
atmega328.upload.speed=57600

atmega328.bootloader.low_fuses=0xFF
atmega328.bootloader.high_fuses=0xDA
atmega328.bootloader.extended_fuses=0x05
atmega328.bootloader.path=atmega
atmega328.bootloader.file=ATmegaBOOT_168_atmega328.hex
atmega328.bootloader.unlock_bits=0x3F
atmega328.bootloader.lock_bits=0x0F

atmega328.build.mcu=atmega328p
atmega328.build.f_cpu=16000000L
atmega328.build.core=arduino
atmega328.build.variant=standard

##############################################################

diecimila.name=Arduino Diecimila or Duemilanove w/ ATmega168

diecimila.upload.protocol=arduino
diecimila.upload.maximum_size=14336
diecimila.upload.speed=19200

diecimila.bootloader.low_fuses=0xff
diecimila.bootloader.high_fuses=0xdd
diecimila.bootloader.extended_fuses=0x00
diecimila.bootloader.path=atmega
diecimila.bootloader.file=ATmegaBOOT_168_diecimila.hex
diecimila.bootloader.unlock_bits=0x3F
diecimila.bootloader.lock_bits=0x0F

diecimila.build.mcu=atmega168
diecimila.build.f_cpu=16000000L
diecimila.build.core=arduino
diecimila.build.variant=standard

##############################################################

nano328.name=Arduino Nano w/ ATmega328

nano328.upload.protocol=arduino
nano328.upload.maximum_size=30720
nano328.upload.speed=57600

nano328.bootloader.low_fuses=0xFF
nano328.bootloader.high_fuses=0xDA
nano328.bootloader.extended_fuses=0x05
nano328.bootloader.path=atmega
nano328.bootloader.file=ATmegaBOOT_168_atmega328.hex
nano328.bootloader.unlock_bits=0x3F
nano328.bootloader.lock_bits=0x0F

nano328.build.mcu=atmega328p
nano328.build.f_cpu=16000000L
nano328.build.core=arduino
nano328.build.variant=eightanaloginputs

##############################################################

nano.name=Arduino Nano w/ ATmega168

nano.upload.protocol=arduino
nano.upload.maximum_size=14336
nano.upload.speed=19200

nano.bootloader.low_fuses=0xff
nano.bootloader.high_fuses=0xdd
nano.bootloader.extended_fuses=0x00
nano.bootloader.path=atmega
nano.bootloader.file=ATmegaBOOT_168_diecimila.hex
nano.bootloader.unlock_bits=0x3F
nano.bootloader.lock_bits=0x0F

nano.build.mcu=atmega168
nano.build.f_cpu=16000000L
nano.build.core=arduino
nano.build.variant=eightanaloginputs

##############################################################

mega2560.name=Arduino Mega 2560 or Mega ADK

mega2560.upload.protocol=stk500v2
mega2560.upload.maximum_size=258048
mega2560.upload.speed=115200

mega2560.bootloader.low_fuses=0xFF
mega2560.bootloader.high_fuses=0xD8
mega2560.bootloader.extended_fuses=0xFD
mega2560.bootloader.path=stk500v2
mega2560.bootloader.file=stk500boot_v2_mega2560.hex
mega2560.bootloader.unlock_bits=0x3F
mega2560.bootloader.lock_bits=0x0F

mega2560.build.mcu=atmega2560
mega2560.build.f_cpu=16000000L
mega2560.build.core=arduino
mega2560.build.variant=mega

##############################################################

mega.name=Arduino Mega (ATmega1280)

mega.upload.protocol=arduino
mega.upload.maximum_size=126976
mega.upload.speed=57600

mega.bootloader.low_fuses=0xFF
mega.bootloader.high_fuses=0xDA
mega.bootloader.extended_fuses=0xF5
mega.bootloader.path=atmega
mega.bootloader.file=ATmegaBOOT_168_atmega1280.hex
mega.bootloader.unlock_bits=0x3F
mega.bootloader.lock_bits=0x0F

mega.build.mcu=atmega1280
mega.build.f_cpu=16000000L
mega.build.core=arduino
mega.build.variant=mega

